------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\caroline\nsaids-covid-research\analysis\arthritis_log\flow_chart_b_arthritis.log
  log type:  text
 opened on:  27 Jul 2020, 16:35:08

. 
. /*
> # osteoarthritis/ rheumatoid arthritis pop
> has_follow_up AND
> (rheumatoid OR osteoarthritis) AND
> (age >=18 AND age <= 110) AND
> imd >0 AND NOT (
> (has_asthma AND saba_single) OR
> aspirin_ten_years OR
> stroke OR
> mi OR
> gi_bleed_ulcer
> */
. safecount
  33,356,521

. drop if has_follow_up!=1
(11,695,479 observations deleted)

. safecount
  21,661,042

. keep if !missing(rheumatoid) | !missing(osteoarthritis)
(18,955,151 observations deleted)

. safecount
  2,705,891

. drop if age < 18 | age > 110
(1,444 observations deleted)

. safecount
  2,704,447

. keep if imd>0
(25,239 observations deleted)

. safecount
  2,679,208

. drop if has_asthma==1 & !missing(saba_single)
(198,126 observations deleted)

. safecount
  2,481,082

. drop if !missing(aspirin_ten_years)
(632,802 observations deleted)

. safecount
  1,848,280

. drop if !missing(stroke)
(53,683 observations deleted)

. safecount
  1,794,597

. drop if !missing(mi)
(9,808 observations deleted)

. safecount
  1,784,789

. drop if !missing(gi_bleed_ulcer)
(73,176 observations deleted)

. safecount
  1,711,613

. 
. log close
      name:  <unnamed>
       log:  E:\caroline\nsaids-covid-research\analysis\arthritis_log\flow_chart_b_arthritis.log
  log type:  text
 closed on:  27 Jul 2020, 16:35:18
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
