------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\caroline\nsaids-covid-research\analysis\arthritis_log_DAG\flow_chart_a_nsaids.log
  log type:  text
 opened on:  27 Jul 2020, 15:29:25

. 
. /*
> # NSAID pop (RECEIVED NSAID IN PAST THREE YEARS PRIOR TO 1 MARCH 2020)
> has_follow_up AND
> nsaid_last_three_years AND
> (age >=18 AND age <= 110) AND
> imd >0 AND NOT (  
> (has_asthma AND saba_single) OR
> aspirin_ten_years OR
> stroke OR
> mi OR
> gi_bleed_ulcer
> */
. safecount
  33,356,521

. drop if has_follow_up!=1
(11,695,479 observations deleted)

. safecount
  21,661,042

. drop if missing(nsaid_last_three_years)
(18,400,531 observations deleted)

. safecount
  3,260,511

. drop if age < 18 | age > 110
(226,139 observations deleted)

. safecount
  3,034,372

. drop if imd==.
(0 observations deleted)

. safecount
  3,034,372

. drop if has_asthma==1 & !missing(saba_single)
(176,733 observations deleted)

. safecount
  2,857,639

. drop if !missing(aspirin_ten_years)
(297,397 observations deleted)

. safecount
  2,560,242

. drop if !missing(stroke)
(21,288 observations deleted)

. safecount
  2,538,954

. drop if !missing(mi)
(2,841 observations deleted)

. safecount
  2,536,113

. drop if !missing(gi_bleed_ulcer)
(41,852 observations deleted)

. safecount
  2,494,261

. 
. log close
      name:  <unnamed>
       log:  E:\caroline\nsaids-covid-research\analysis\arthritis_log_DAG\flow_chart_a_nsaids.log
  log type:  text
 closed on:  27 Jul 2020, 15:29:34
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
